budvar10/Arduino-ATmega1284P/cores/arduino/wiring.c
/****************************************************************************************
 *               *** Arduino pin definition functions for ATmega1284p ***               *
 *                               Copyright (c) 2015  badio                              *
 *                                  All Rights Reserved                                 *
 ****************************************************************************************
 ---- b a d i o  C++ ----

    File name: wiring.c

    Description:
    Partial implementation of the Wiring API for the ATmega. Based on Arduino wiring.c.

    Functions:
    millis              - milliseconds since the Arduino board began running
    micros              - microseconds since the Arduino board began running
    delay               - pauses the program for the amount of time in miliseconds
    delayMicroseconds   - pauses the program for the amount of time in microseconds
    init                - system initialization

=========================================================================================

                               *** Original copyright ***

    wiring.c - Partial implementation of the Wiring API for the ATmega8.
    Part of Arduino - http://www.arduino.cc/

    Copyright (c) 2005-2006 David A. Mellis

    //-----------------------------------------------------------------------------//
    // This library is free software; you can redistribute it and/or modify it     //
    // under the terms of the GNU Lesser General Public License as published by    //
    // the Free Software Foundation; either version 2.1 of the License,            //
    // or (at your option) any later version.                                      //
    //                                                                             //
    // This library is distributed in the hope that it will be useful, but WITHOUT //
    // ANY WARRANTY; without even the implied warranty of MERCHANTABILITY          //
    // or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU Lesser General Public     //
    // License for more details.                                                   //
    //                                                                             //
    // You should have received a copy of the GNU Lesser General Public License    //
    // along with this library; if not, write to the Free Software Foundation,     //
    // Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA              //
    //-----------------------------------------------------------------------------//

    $Id$

=========================================================================================

    12.08.2014 - added "PRO functionality" to increase accuracy of time functions for
                 higher crystal frequency 16 MHz, 18 MHz, 18,432 MHz and 20 MHz; it uses
                 compare match interrupt instead of overflow but no each MCU has it
               - timer0_overflow_count keeps interrupt count and seems to be meaningless
                 so it was changed to variable keeping microseconds: timer0_micros (only
                 PRO version)

    29.08.2014 - slightly increasing millis() accuracy (growth for 32 bytes)
               - added definitions to clean source code

    11.12.2014 - corrected value in function micros() as follows:
                 MICROSECONDS_PER_TIMER0_INTERRUPT/64 = 16; TIMER0_TOP/64 = 1 (k = 16)
                 return(m + ((uint16_t)t << 4));

    14.07.2015 - support for 24MHz; changes in delayMicroseconds()

 */

/* include */
#include "wiring_private.h"

/* definitions */
#define __ARDUINO_PRO__ 1   // change it to 0 to make the original functionality
#define HARDWARE_PWM    0   // change it to 1 to make an initialization
#define A2D_CONVERTOR   1   // change it to 1 to make an initialization

// --------------------------------------------------------------------------------------
//                      *** Arduino Time functions definitions ***

#if !defined(__ARDUINO_PRO__) || __ARDUINO_PRO__ == 0   // original Arduino
/* Timer/Counter0 - the prescaler is set so that timer ticks every 64 clock cycles,
   and the overflow handler is called every 256 ticks
 */
    #define TIMER0_PRESCALER     64
    #define TIMER0_TOP          256

/* Timer/Counter0 Overflow */
    #if defined(__AVR_ATtiny24__) || defined(__AVR_ATtiny44__) || defined(__AVR_ATtiny84__)
        #define TIMER0_ISR_vect TIM0_OVF_vect
    #else
        #define TIMER0_ISR_vect TIMER0_OVF_vect
    #endif

/* Timer/Counter0 interrupt flag */
    #define TIMER0_INT_FLAG     TOV0
#else                                                   // Arduino PRO
/* Timer/Counter0 - the prescaler is set so that timer ticks every 256 clock cycles,
   and the compare match handler is called after top value is reached
 */
    #define TIMER0_PRESCALER    256

    #if F_CPU == 24000000L
        #define TIMER0_TOP       96     // F_CPU / 250000L
    #elif F_CPU == 20000000L
        #define TIMER0_TOP       80     // F_CPU / 250000L
    #elif F_CPU == 184320000L
        #define TIMER0_TOP       72     // F_CPU / 256000L
    #elif F_CPU == 18000000L
        #define TIMER0_TOP       72     // F_CPU / 250000L
    #elif F_CPU == 16000000L
        #define TIMER0_TOP       64     // F_CPU / 250000L
    #else
        #define TIMER0_TOP      (F_CPU / 250000L)
    #endif

/* Timer/Counter0 Compare Match A */
    #if defined(__AVR_ATtiny24__) || defined(__AVR_ATtiny44__) || defined(__AVR_ATtiny84__)
        #define TIMER0_ISR_vect TIM0_COMPA_vect
    #else
        #define TIMER0_ISR_vect TIMER0_COMPA_vect
    #endif

/* Timer/Counter0 interrupt flag */
    #define TIMER0_INT_FLAG     OCF0A

/* global counter for microseconds */
    #define timer0_micros       timer0_interrupt_count 
#endif

/* Timer/Counter0 internal counter */
#if defined(TCNT0)
    #define TIMER0_CNT          TCNT0
#elif defined(TCNT0L)
    #define TIMER0_CNT          TCNT0L
#else
    #error TIMER 0 not defined
#endif

/* Timer/Counter0 wait for interrupt */
#ifdef TIFR0
    #define TIMER0_INT_WAIT    (TIFR0 & _BV(TIMER0_INT_FLAG))
#else
    #define TIMER0_INT_WAIT    (TIFR0 & _BV(TIMER0_INT_FLAG))
#endif

/* definition doesn't loose precision for kHz */
#define MICROSECONDS_PER_TIMER0_INTERRUPT ((TIMER0_PRESCALER * TIMER0_TOP * 1000L) / \
                                           (F_CPU / 1000L))

/* the whole number of milliseconds per Timer/Counter0 interrupt */
#define MILLIS_INC (MICROSECONDS_PER_TIMER0_INTERRUPT / 1000)

