budvar10/Arduino-ATmega1284P/cores/arduino/wiring.c
/* the fractional number of milliseconds per Timer/Counter0 Overflow, it is shifted right
   by three to fit these numbers into a byte (for the clock speeds it is cared about - 8
   and 16 MHz - this doesn't lose precision; and also for 18 MHz, 18,432 Mhz and 20MHz
   with Arduino PRO version)
 */
#define FRACT_INC ((MICROSECONDS_PER_TIMER0_INTERRUPT % 1000) >> 3)
#define FRACT_MAX (1000 >> 3)

/* global counters */
volatile unsigned long timer0_interrupt_count = 0;
volatile unsigned long timer0_millis          = 0;
static unsigned char   timer0_fract           = 0;

// --------------------------------------------------------------------------------------
//
// **************************
// *  ISR(TIMER0_ISR_vect)  *
// **************************
//
// ISR (Interrupt Service Routine) for Timer/Counter0 interrupt

ISR(TIMER0_ISR_vect)
{
/* copy these to local variables so they can be stored in registers (volatile variables
   must be read from memory on every access)
 */
unsigned long m = timer0_millis;
unsigned char f = timer0_fract;

    m += MILLIS_INC;
    f += FRACT_INC;

    if(f >= FRACT_MAX) {
        f -= FRACT_MAX;
        m += 1;
    }

    timer0_fract  = f;
    timer0_millis = m;

    #if !defined(__ARDUINO_PRO__) || __ARDUINO_PRO__ == 0
        timer0_interrupt_count++;
    #else
        timer0_micros += MICROSECONDS_PER_TIMER0_INTERRUPT;
    #endif
}


// --------------------------------------------------------------------------------------
//
// ************
// *  millis  *
// ************
//
// Milliseconds since the Arduino board began running (number will overflow after 50 days
// approximately ~ exactly after: 49 days, 17 h, 2 min, 47 s, 286 ms)

unsigned long millis()
{
unsigned long m;
uint8_t       oldSREG = SREG;
uint8_t       t;

/* disable interrupts while read timer0_millis or it might get an inconsistent value
   (e.g. in the middle of a write to timer0_millis)
 */
    cli();

    m = timer0_millis;

/* if a flag is set (interrupt is queued) and counter is wrapped out, then +1 and another
   +1 for gathered fragments eventually 
 */
    t = TIMER0_CNT;

    if((TIMER0_INT_WAIT) && (t < (TIMER0_TOP - 1))) {
        t = ((timer0_fract >= (FRACT_MAX - FRACT_INC)) ? 2 : 1 );
        m += t;
    }

    SREG = oldSREG;

    return(m);
}

// --------------------------------------------------------------------------------------
//
// ************
// *  micros  *
// ************
//
// Microseconds since the Arduino board began running (number will overflow after 70 min.
// approximately)

unsigned long micros()
{
unsigned long m;
uint8_t       t;
uint8_t       oldSREG = SREG;
    
    cli();

/* actual counter state of an interrupts or microseconds per whole interrupts */
    #if !defined(__ARDUINO_PRO__) || __ARDUINO_PRO__ == 0
        m = timer0_interrupt_count;
    #else
        m = timer0_micros;
    #endif

/* timer counter - was not evaluated yet */
    t = TIMER0_CNT;
  
/* if a flag is set (interrupt is queued) and counter is wrapped out */
    if(((TIMER0_INT_WAIT)) && (t < (TIMER0_TOP - 1))) {
        #if !defined(__ARDUINO_PRO__) || __ARDUINO_PRO__ == 0
            m++;
        #else
            t += TIMER0_TOP;
        #endif
    }

    SREG = oldSREG;
    
    #if !defined(__ARDUINO_PRO__) || __ARDUINO_PRO__ == 0
        return((m << 8) + t) * (64 / clockCyclesPerMicrosecond());
    #else
    /* Optimal multiplier and divisor for timer counter keeps the value in size of word
       to ensure max. accuracy and prevents to overflow. Top value is factorized into
       multiplier and divisor to obtain particular values without decimals e.g.:
       for 20MHz; TIMER0_TOP = 80 => 16 * 5; multiplier = 1024/16; divisor = 5 (80/16).
       Those values represent coefficient (k) in result with which is needed to multiply
       the counter value to obtain microseconds (for whole interrupt TIMER0_TOP * k = us;
       for 20MHz osc. 80 * 12,8 = 1024).
       NOTE: First step is to find the largest common divisor for the microseconds per
             interrupt and the timer top value.
     */
        #if F_CPU == 24000000L
        /* MICROSECONDS_PER_TIMER0_INTERRUPT/32 = 32; TIMER0_TOP/32 = 3 (k = 10.66..) */
            return(m + (((uint16_t)t << 5) / (TIMER0_TOP >> 5)));
        #elif F_CPU == 20000000L
        /* MICROSECONDS_PER_TIMER0_INTERRUPT/16 = 64; TIMER0_TOP/16 = 5 (k = 12,8) */
            return(m + (((uint16_t)t << 6) / (TIMER0_TOP >> 4)));
        #elif F_CPU == 18432000L
        /* MICROSECONDS_PER_TIMER0_INTERRUPT/8 = 125; TIMER0_TOP/8 = 9 (k = 13,88..) */
            return(m + (((uint16_t)t * 125) / (TIMER0_TOP >> 3)));
        #elif F_CPU == 18000000L
        /* MICROSECONDS_PER_TIMER0_INTERRUPT/8 = 128; TIMER0_TOP/8 = 9 (k = 14,22..) */
            return(m + (((uint16_t)t << 7) / (TIMER0_TOP >> 3)));
        #elif F_CPU == 16000000L
        /* MICROSECONDS_PER_TIMER0_INTERRUPT/64 = 16; TIMER0_TOP/64 = 1 (k = 16) */
            return(m + ((uint16_t)t << 4));
        #else
            return(m + (((uint32_t)t * MICROSECONDS_PER_TIMER0_INTERRUPT) / TIMER0_TOP));
        #endif
    #endif
}

// --------------------------------------------------------------------------------------
//
// ***********
// *  delay  *
// ***********
//
// Pauses the program for the amount of time in milliseconds

void delay(unsigned long ms)
{
    uint16_t start = (uint16_t)micros();

    while(ms > 0) {
        if(((uint16_t)micros() - start) >= 1000) {
            ms--;
            start += 1000;
        }
    }
}

// --------------------------------------------------------------------------------------
//
// ***********************
// *  delayMicroseconds  *
// ***********************
//
// Pauses the program for the amount of time in microseconds

void delayMicroseconds(unsigned int us)
    /* Delay for the given number of microseconds. Assumes a 8 or 16 MHz clock. */
{
/* Calling avrlib's delay_us() function with low values (e.g. 1 or 2 microseconds) gives
   delays longer than desired.
   NOTE: This is no true. The delay_us() provides exact delay!

   Function call:  2 + 3 cycles for constant parameter (2xLDI + RCALL)
                   4 + 3 cycles for variable parameter (2xLDS + RCALL).
   If the program is small or simply near of the function can use RJMP (only 2 cycles)
   instead of RCALL.
   Longer delay is more accurate.
 */

/* 24 MHz overclocked Arduino boards */
#if F_CPU >= 24000000L

