budvar10/Arduino-ATmega1284P/cores/arduino/wiring.c
    // function call is considered 5 cycles (LDI, LDI, RCALL) - constant parameter

    // zero delay fix
    if(!us) return;             // 3 cycles, 4 cycles when true

    // the following loop takes a 1/6 of a microsecond (4 cycles) per iteration,
    // so execute it six times for each microsecond of delay requested
    us = ((us << 1) + us) << 1; // x6 us, 7 cycles

    // 1 us correction: preceeding commands takes 15 cycles for constant parameter,
    // the rest of cycles is 3 + 4 for the busy wait and the return, and the next command
    // takes 2 cycles, us is 6 so substract 5 to obtain exactly 24 = (15 + 2 + 3 + 4)
    us -= 5;                    // 2 cycles

/* 20 MHz clock on rare Arduino boards */
#elif F_CPU >= 20000000L

    // function call is considered 5 cycles (LDI, LDI, RCALL) - constant parameter

    // the following loop takes a 1/5 of a microsecond (4 cycles) per iteration,
    // so execute it five times for each microsecond of delay requested
    us = (us << 2) + us;        // x5 us, 7 cycles

    // 0 and 1 us: preceeding commands takes 12 cycles and next if and return takes 8,
    // so totally 20 cycles 
    if(us <= 5) return;         // 3 cycles, 4 cycles when true

    // account for the time taken in the preceeding commands
    us -= 6;                    // 2 + 1 cycles (1 for register pair move ?)

    // for the first us (if us > 1) the preceeding commands takes 18 cycles, 2 cycles
    // are missing and additional one for the last loop in the end of function
    // 3 cycles totally
    __asm__ __volatile__ (
        "nop" "\n\t"
        "nop" "\n\t"
        "nop");                 // just waiting 3 cycles

/* 16 MHz clock on most Arduino boards */
#elif F_CPU >= 16000000L

    // zero delay fix
    if(!us) return;             // 3 cycles, 4 cycles when true

    // for a one-microsecond delay, simply return,
    // the overhead of the function call yields a delay of exactly 1us
    if(--us == 0) return;       // 3 cycles, 4 cycles when true

    // the following loop takes a 1/4 of a microsecond (4 cycles) per iteration,
    // so execute it four times for each microsecond of delay requested
    us <<= 2;                   // x4 us, 4 cycles

    // for the first us (if us > 1) the preceeding commands takes 15 cycles at now,
    // 1 cycle is still missing and additional one for the last loop,
    // 2 cycles totally, substracting one loop takes it
    // account for the time taken in the preceeding commands
    us -= 1;                    // 2 cycles

/* 12 MHz clock if somebody is working with USB */
#elif F_CPU >= 12000000L

    // for a 0 and 1 microsecond delay, simply return the overhead of the function call
    // takes 14 (16) cycles, which is 1.5us
    if(us <= 1) return;         // 3 cycles, 4 cycles when true

    // the following loop takes a 1/3 of a microsecond (4 cycles) per iteration,
    // so execute it three times for each microsecond of delay requested
    us = (us << 1) + us;        // x3 us, 5 cycles

    // account for the time taken in the preceeding commands, we just burned 20 (22)
    // cycles above, remove 5, (5*4=20) us is at least 6 so we can substract 5
    us -= 5;                    // 2 cycles

/* 8 MHz internal clock */
#elif F_CPU >= 8000000L

    // for a 0, 1 and 2 microsecond delay, simply return, the overhead of the function
    // call takes 13 (15) cycles, which is 2us approximately
    if(us <= 2) return;         // 3 cycles, 4 cycles when true

    // the following loop takes 1/2 of a microsecond (4 cycles) per iteration,
    // so execute it twice for each microsecond of delay requested
    us <<= 1;                   // x2 us, 2 cycles

    // account for the time taken in the preceeding commands, we just burned 17 (19)
    // cycles above, remove 4, (4*4=16) us is at least 6 so we can substract 4
    us -= 4;                    // 2 cycles

    // 1 cycle for the last loop, it takes only 3 cycles
    __asm__ __volatile__ ("nop");

/* 1 MHz internal clock (default settings for common Atmega microcontrollers) */
#else

    // 1 cycle at 1 MHz is exactly 1 us delay e.g. NOP instruction
    // __asm__ __volatile__ ("nop");
    //

    // the overhead of the function calls is 14 (16) cycles
    if(us <= 25) return;        // 3 cycles, 4 cycles when true, (must be at least 25
                                // to be able substract 22)

    // compensate for the time taken by the preceeding and next commands (about 22 cycles)
    us -= 22;                   // 2 cycles

    // the following loop takes 4 microseconds (4 cycles) per iteration,
    // so execute it us/4 times
    // us is at least 4, divided by 4 gives us 1 (no zero delay bug)
    us >>= 2; // us / 4, 4 cycles
    
#endif

/* busy wait */
    __asm__ __volatile__ (
        "1: sbiw %0,1" "\n\t"               // 2 cycles
        "   brne 1b" : "=w" (us) : "0" (us) // 2 cycles, 1 cycle when false
    );

    return;     // 4 cycles
}

// --------------------------------------------------------------------------------------
//
// **********
// *  init  *
// **********
//
// System initialization

void init()
    /* This needs to be called before setup() or some functions won't work there. */
{
/* original Arduino setup */
    #if !defined(__ARDUINO_PRO__) ||  __ARDUINO_PRO__ == 0

        sei();
        
    /* On the ATmega168, timer 0 is also used for fast hardware PWM (using phase-correct
       PWM would mean that timer 0 overflowed half as often resulting in different
       millis() behavior on the ATmega8 and ATmega168)
     */
        #if defined(TCCR0A) && defined(WGM01)
            sbi(TCCR0A, WGM01);
            sbi(TCCR0A, WGM00);
        #endif  

    /* set Timer/Counter0 Overflow prescale factor to 64 */
        #if defined(__AVR_ATmega128__)
            // CPU specific: different values for the ATmega128
            sbi(TCCR0, CS02);
        #elif defined(TCCR0) && defined(CS01) && defined(CS00)
            // this combination is for the standard ATmega8
            sbi(TCCR0, CS01);
            sbi(TCCR0, CS00);
        #elif defined(TCCR0B) && defined(CS01) && defined(CS00)
            // this combination is for the standard 168/328/1280/2560
            sbi(TCCR0B, CS01);
            sbi(TCCR0B, CS00);
        #elif defined(TCCR0A) && defined(CS01) && defined(CS00)
            // this combination is for the __AVR_ATmega645__ series
            sbi(TCCR0A, CS01);
            sbi(TCCR0A, CS00);
        #else
            #error Timer 0 prescale factor 64 not set correctly
        #endif

    /* enable Timer/Counter0 Overflow interrupt */
        #if defined(TIMSK) && defined(TOIE0)
            sbi(TIMSK, TOIE0);
        #elif defined(TIMSK0) && defined(TOIE0)
            sbi(TIMSK0, TOIE0);
        #else
            #error  Timer 0 overflow interrupt not set correctly
        #endif

/* Arduino PRO */
    #else

        cli();

    /* set Timer/Counter0 CTC mode */
        #if defined(TCCR0A) && defined(WGM01)
            TCCR0A = (1 << WGM01);
        #endif  

    /* set Timer/Counter0 CTC prescale factor to 256 */
        #if defined(__AVR_ATmega128__)
            // CPU specific: different values for the ATmega128
            TCCR0  = (1 << WGM01 | 1 << CS02 | 1 << CS01)
            TCCR0  = (1 << CS02);
        #elif defined(TCCR0B) && defined(CS02)
            // this combination is for the standard 168/328/644/1284
            TCCR0B = (1 << CS02);
        #elif defined(TCCR0A) && defined(CS02)
            // this combination is for the __AVR_ATmega645__ series
            sbi(TCCR0A, CS02);
        #else
            #error Timer 0 prescale factor 256 not set correctly
        #endif

    /* set Timer/Counter0 CTC top value */
        #if defined(OCR0A)
            OCR0A  = (TIMER0_TOP - 1);
        #elif defined(OCR0)
            OCR0   = (TIMER0_TOP - 1);
        #else
            #error  Timer 0 CTC top value not set correctly
        #endif

    /* Timer/Counter0 counter register reset */
        #if defined(TCNT0)
            TCNT0  = 0;
        #else
            #error  Timer 0 CTC counter not set correctly
        #endif

    /* enable Timer/Counter0 Compare Match interrupt */
        #if defined(TIMSK) && defined(OCIE0)
            TIMSK  = (1 << OCIE0);
        #elif defined(TIMSK0) && defined(OCIE0A)
            TIMSK0 = (1 << OCIE0A);
        #else
            #error  Timer 0 CTC interrupt not set correctly
        #endif

        sei();

    #endif

/* Timer/Counter1 and Timer/Counter2 are used for phase-correct hardware pwm, this is
   better for motors as it ensures an even waveform note, however, that fast pwm mode can
   achieve a frequency of up 8 MHz (with a 16 MHz clock) at 50% duty cycle
 */
    #if (HARDWARE_PWM == 1)

    /* set Timer/Counter1 prescale factor to 64 */
        #if defined(TCCR1B) && defined(CS11) && defined(CS10)
            TCCR1B = 0;
            sbi(TCCR1B, CS11);
            #if F_CPU >= 8000000L
                sbi(TCCR1B, CS10);
            #endif
        #elif defined(TCCR1) && defined(CS11) && defined(CS10)
            sbi(TCCR1, CS11);
            #if F_CPU >= 8000000L
                sbi(TCCR1, CS10);
            #endif
        #endif

