budvar10/Arduino-ATmega1284P/cores/arduino/wiring.c
    /* configure  Timer/Counter1 for 8-bit phase correct PWM mode */
        #if defined(TCCR1A) && defined(WGM10)
            sbi(TCCR1A, WGM10);
        #elif defined(TCCR1)
            #warning this needs to be finished
        #endif

    /* set Timer/Counter2 prescale factor to 64 */
        #if defined(TCCR2) && defined(CS22)
            sbi(TCCR2, CS22);
        #elif defined(TCCR2B) && defined(CS22)
            sbi(TCCR2B, CS22);
        #else
            #warning Timer 2 not finished (may not be present on this CPU)
        #endif

    /* configure  Timer/Counter2 for 8-bit phase correct PWM mode */
        #if defined(TCCR2) && defined(WGM20)
            sbi(TCCR2, WGM20);
        #elif defined(TCCR2A) && defined(WGM20)
            sbi(TCCR2A, WGM20);
        #else
            #warning Timer 2 not finished (may not be present on this CPU)
        #endif

    /* set Timer/Counter3 prescale factor to 64 and 8-bit phase correct PWM mode */
        #if defined(TCCR3B) && defined(CS31) && defined(WGM30)
            sbi(TCCR3B, CS31);      // prescale factor to 64
            sbi(TCCR3B, CS30);
            sbi(TCCR3A, WGM30);     // 8-bit phase correct PWM mode
        #endif

    /* set Timer/Counter4 prescale factor to 64 and 8-bit phase correct PWM mode */
        #if defined(TCCR4A) && defined(TCCR4B) && defined(TCCR4D) /* 32U4 and similar */
            sbi(TCCR4B, CS42);      // prescale factor to 64
            sbi(TCCR4B, CS41);
            sbi(TCCR4B, CS40);

            sbi(TCCR4D, WGM40);     // phase- and frequency-correct PWM mode

            sbi(TCCR4A, PWM4A);     // enable PWM mode for comparator OCR4A
            sbi(TCCR4C, PWM4D);     // enable PWM mode for comparator OCR4D

        #else /* ATmega1280 and ATmega2560 */
            #if defined(TCCR4B) && defined(CS41) && defined(WGM40)
                sbi(TCCR4B, CS41);  // prescale factor to 64
                sbi(TCCR4B, CS40);
                sbi(TCCR4A, WGM40); // 8-bit phase correct PWM mode
            #endif
        #endif

    /* set Timer/Counter5 prescale factor to 64 and 8-bit phase correct PWM mode */
        #if defined(TCCR5B) && defined(CS51) && defined(WGM50)
            sbi(TCCR5B, CS51);      // prescale factor to 64
            sbi(TCCR5B, CS50);
            sbi(TCCR5A, WGM50);     // 8-bit phase correct PWM mode
        #endif

    #endif // (HARDWARE_PWM == 1)


    #if (A2D_CONVERTOR == 1)
        #if defined(ADCSRA)
            // set A2D prescale factor to 128
            // 16 MHz / 128 = 125 KHz, inside the desired 50-200 KHz range.
            // XXX: this will not work properly for other clock speeds, and
            // this code should use F_CPU to determine the prescale factor.
            // Also for 20 MHz / 128 = 156,250 kHz.
//          sbi(ADCSRA, ADPS2);
//          sbi(ADCSRA, ADPS1);
//          sbi(ADCSRA, ADPS0);

            // enable A2D conversions
//          sbi(ADCSRA, ADEN);

            #if defined(__ARDUINO_PRO__) ||  __ARDUINO_PRO__ != 0

                // all in one; it saves about 18 bytes
                ADCSRA |= (_BV(ADEN) | _BV(ADPS2) | _BV(ADPS1) | _BV(ADPS0));

            #else

                // v1.6.x implementation; it suppressed by previous command
                #if F_CPU >= 16000000   // 16 MHz / 128 = 125 KHz
                    sbi(ADCSRA, ADPS2);
                    sbi(ADCSRA, ADPS1);
                    sbi(ADCSRA, ADPS0);
                #elif F_CPU >= 8000000  // 8 MHz / 64 = 125 KHz
                    sbi(ADCSRA, ADPS2);
                    sbi(ADCSRA, ADPS1);
                    cbi(ADCSRA, ADPS0);
                #elif F_CPU >= 4000000  // 4 MHz / 32 = 125 KHz
                    sbi(ADCSRA, ADPS2);
                    cbi(ADCSRA, ADPS1);
                    sbi(ADCSRA, ADPS0);
                #elif F_CPU >= 2000000  // 2 MHz / 16 = 125 KHz
                    sbi(ADCSRA, ADPS2);
                    cbi(ADCSRA, ADPS1);
                    cbi(ADCSRA, ADPS0);
                #elif F_CPU >= 1000000  // 1 MHz / 8 = 125 KHz
                    cbi(ADCSRA, ADPS2);
                    sbi(ADCSRA, ADPS1);
                    sbi(ADCSRA, ADPS0);
                #else                   // 128 kHz / 2 = 64 KHz -> this is the closest
                    cbi(ADCSRA, ADPS2);
                    cbi(ADCSRA, ADPS1);
                    sbi(ADCSRA, ADPS0);
                #endif

                // enable A2D conversions
                sbi(ADCSRA, ADEN);

            #endif
        #endif
    #endif // (A2D_CONVERTOR == 1)


/* the bootloader connects pins 0 and 1 to the USART; disconnect them here so they can be
   used as normal digital I/O; they will be reconnected in Serial.begin()
 */
    #if defined(UCSRB)
        UCSRB = 0;
    #elif defined(UCSR0B)
        UCSR0B = 0;
    #endif
}
